{
  "from": "stock-tracker@ai-builders.space",
  "newsSearch": [
    "https://finance.yahoo.com/",
    "https://www.marketwatch.com/",
    "https://www.nasdaq.com/",
    "https://www.investing.com/"
  ],
  "time": "2026-01-19T08:00:00+08:00",
  "to": [
    "david11yf29@gmail.com",
    "chenchuchugrace@gmail.com"
  ],
  "subject": "Stocker Tracker Report",
  "content": {
    "dailyPriceChange": [
      {
        "symbol": "LRCX",
        "name": "Lam Research Corporation",
        "price": 220.7,
        "changePercent": -3.37,
        "date": "2026-01-23T05:00:00+08:00",
        "news": "Lam Research Corporation (LRCX) stock declined by 3.37% to $220.70 amid high trading volume of 11.46 million shares, despite a strong year-to-date gain of 33.42%. The drop occurred without specific news catalysts detailed in recent reports, though broader semiconductor sector pressures, including tariff concerns and analyst notes on moderating wafer fabrication equipment spending beyond 2025, may have contributed. The stock remains in focus ahead of its upcoming earnings on January 28, 2026, with positive analyst upgrades from firms like Zacks to \"Strong-Buy\" highlighting AI-driven demand potential."
      },
      {
        "symbol": "SNAP",
        "name": "Snap Inc.",
        "price": 7.66,
        "changePercent": 3.93,
        "date": "2026-01-23T05:00:00+08:00",
        "news": "**Snap Inc. (SNAP) stock rose about 3.93% after settling a major lawsuit accusing Snapchat of addicting young users to social media, avoiding a high-profile \"bellwether\" trial that could have influenced similar cases against Meta, TikTok, and YouTube.** The amicable resolution, with undisclosed terms confirmed by Snap and the Social Media Victims Law Centre, eased investor concerns over legal risks and negative publicity. Shares initially jumped 4.5% before settling at $7.67, up 4% from the prior close, amid the company's ongoing volatility (22 moves >5% in the past year)."
      }
    ],
    "needToDropUntilBuyPrice": [
      {
        "symbol": "LRCX",
        "price": 220.7,
        "diff": -9.38,
        "date": "2026-01-23T05:00:00+08:00"
      },
      {
        "symbol": "SNAP",
        "price": 7.66,
        "diff": -7.18,
        "date": "2026-01-23T05:00:00+08:00"
      },
      {
        "symbol": "SOXL",
        "price": 63.72,
        "diff": -52.92,
        "date": "2026-01-23T05:00:00+08:00"
      },
      {
        "symbol": "IBIT",
        "price": 50.67,
        "diff": -11.19,
        "date": "2026-01-23T05:00:00+08:00"
      }
    ]
  }
}